<a href="https://colab.research.google.com/github/shishkovamarina/DataBase/blob/master/sql_course.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
import sqlite3

# **Заливка данных**

In [12]:
con = sqlite3.connect('db')

In [3]:
!gdown --id 1Gj0qVU0Acv-HqRjTIEwvkO4TqJYijehR

Downloading...
From: https://drive.google.com/uc?id=1Gj0qVU0Acv-HqRjTIEwvkO4TqJYijehR
To: /content/german_credit_augmented.csv
100% 69.6k/69.6k [00:00<00:00, 4.41MB/s]

In [4]:
df = pd.read_csv('/content/german_credit_augmented.csv')

In [5]:
df.head()

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

In [6]:
df['contract_dt'] = pd.to_datetime(df['contract_dt'],format='%Y-%m-%d %H:%M:%S') #преобразование даты в формат даты

In [7]:
df.dtypes

age                          int64
sex                         object
job                          int64
housing                     object
saving_accounts             object
checking_account            object
credit_amount                int64
duration                     int64
purpose                     object
default                      int64
contract_dt         datetime64[ns]
client_id                    int64
dtype: object

In [13]:
df.to_sql('german_credit',con,index=False,if_exists='replace')

# **Селекты к таблице**

In [8]:
def select(sql):
  return pd.read_sql(sql,con) #обертка для селекта

In [9]:
sql = '''select * from german_credit t'''

In [14]:
select(sql)

     age     sex  job  ... default          contract_dt client_id
0     33    male    2  ...       0  2008-06-29 18:52:00       210
1     43    male    1  ...       0  2007-05-20 18:30:19       929
2     52    male    2  ...       0  2008-04-27 08:23:07       200
3     35  female    3  ...       0  2007-05-06 10:58:22        45
4     28    male    2  ...       0  2007-07-21 13:22:14       358
..   ...     ...  ...  ...     ...                  ...       ...
995   65    male    2  ...       1  2007-12-16 20:17:19       624
996   30    male    3  ...       1  2007-07-12 14:08:58       181
997   33    male    2  ...       0  2008-04-08 03:24:26       730
998   29  female    2  ...       1  2007-11-29 15:51:45       557
999   44    male    2  ...       0  2007-08-14 09:05:33        23

[1000 rows x 12 columns]

In [ ]:
from google.colab import drive
drive.mount('/content/drive')